# تابع برگشتی ضرب اعداد 5 و بالای 5 بر هم
# def mal5(x):
#     if x == 0 :
#         return 1
#     elif x % 10 <5:
#         return mal5(x//10)
#     else:
#         return x%10 * mal5(x//10)
# print(mal5(5874123452))
#--------------------------------------------------
# چاپ اعداد بخش پذیر به 3 از عدد دریافتی
# def func(x):
#     if x < 3:
#         return
#     elif x % 3 == 0:
#         print(x)
#
#     func(x-1)
#
# func(16)
#--------------------------------------------------
# دادن عدد ردیف فیبوناچی و جاپ قیبوناچی ردیف داده شده
# def fib(x):
#     if x == 0 or x == 1:
#         return x
#     return fib(x-1) + fib(x-2)
#
# print(fib(21))