import math
# سه عدد معروف ریاضی
print(math.pi)
print(math.e)
print(math.tau)
# -------------------------------------------
# عدد بینهایت و منفی بی نهایت
print(math.inf)
print(-math.inf)
x = math.inf
print(math.isinf(x))
# -------------------------------------------
# مخفف نات نامبر(برای مقادیر تعریف نشده) مثلا 0 تقسیم 0 یا جزر اعداد منفی
print(math.nan)
y = math.nan
print(math.isnan(y))
# -------------------------------------------
z = 4.336
# کوچیک ترین عدد صحیح بعد از z
print(math.ceil(z))
# بزرگ ترین عدد صحیح قبل از z
print(math.floor(z))
# -------------------------------------------
# قدر مطلق یک عدد در خود پایتون و تابع مف
a = -3.548
print(abs(a))
print(math.fabs(a))
# -------------------------------------------
# 5*4*3*2*1 فاکتوریل یک عدد
b = 5
print(math.factorial(b))
# -------------------------------------------
# log
print(math.log(8, 2))
print(math.log(10000, 10))
print(math.log10(10000))
print(math.log(1024, 2))
print(math.log2(1024))
# -------------------------------------------
# برای پیدا کردن ریشه دوم یا جذر یک عدد
print(math.sqrt(1024))
# گرد کردن جزر یک عدد به نزدیک ترین عدد صحیح
print(math.isqrt(87))
# -------------------------------------------
#  توان یک عدد در خود پایتون و تابع مف
print(pow(2, 8))
print(math.pow(2, 8))
# -------------------------------------------
# متد های مثلثاتی بر اساس رادیان
print(math.sin(45))
print(math.cos(45))
print(math.tan(45))
# -------------------------------------------
# جدا کردن عدد و اعشار آن
print(math.modf(45.58745))
# -------------------------------------------
# حذف اعشار یک عدد
print(math.trunc(45.58745))
# -------------------------------------------
# خروجی عدد اول را برمیدارد و علامت دومی را
print(math.copysign(8, -9))
# -------------------------------------------
# نمایش باقی مانده تقسیم
print(math.fmod(10, 3))
# -------------------------------------------
# نمایش جمع یک دنباله
print(math.fsum((1, 2, 5, 8, 14)))
# -------------------------------------------
# حساب کردن بزرگ ترین مقسوم علیه دو عدد
print(math.gcd(30, 12))
# -------------------------------------------
# کوچیک ترین مضرب مشترک دو عدد
print(math.lcm(30, 12))
# -------------------------------------------
# در ساده ترین استفاده وتر را پیدا میکند اما کاربرد دیگری هم دارد
print(math.hypot(3, 4))
# -------------------------------------------
# حاصل ضرب مجموعه اعداد
print(math.prod((4, 5, 8, 6)))
