import os

# نمایش نام سیستم عامل(nt به معنای ویندوز)
print(os.name)

# -----------------------------------------------------------

#  نمایش مسیر فعلی
print(os.getcwd())

# -----------------------------------------------------------

# تغییر نام یک دایرکتوری یا فایل (ورودی اول مسیر فایل و در ورودی دوم باز مسیر فایل همراه با نام جدید. دقت کنیدمیتوان از ابتدا نیز مسیر داد مثلا از درایو سی به ترتیب)
# os.rename("test.py", "test.py")

# -----------------------------------------------------------

# برسی دسترسی به فایل
# print(os.access("test.py", os.F_OK))
# print(os.access("test.py", os.R_OK))
# print(os.access("test.py", os.W_OK))
# print(os.access("test.py", os.X_OK))

# -----------------------------------------------------------

# نمایش تمامی فایل های موجود در یک دایرکتوری
print(os.listdir(r"C:\Users\Caspian\Desktop\learnit python"))

# -----------------------------------------------------------

# برای ساخت دایرکتوری جدید
#os.mkdir(r"C:\Users\Caspian\Desktop\learnit python\S12\new_tst")
# برای ساخت چند دایرکتوری تو در تو
# os.makedirs(r"C:\Users\Caspian\Desktop\learnit python\S12\new_tst\n1\n2")
# -----------------------------------------------------------

# برای تغییر مسیر از مکان فعلی به دلخواه
# print(os.getcwd())
# os.chdir(r"C:\Users\Caspian\Desktop")
# print(os.getcwd())

# -----------------------------------------------------------

# متغیر های محیطی سیستم
print(os.environ)

# -----------------------------------------------------------

# نمایش اکانت لاگین شده
print(os.getlogin())

# -----------------------------------------------------------

# نمایش محتویات یک دایرکتوری و زیر دایرکتوری هایش
for i in os.walk(r"C:\Users\Caspian\Desktop\learnit python\S12"):
    print(i)

# -----------------------------------------------------------

# برای حذف یک فایل
# os.remove(r"C:\Users\Caspian\Desktop\learnit python\S12\new_tst\t.py")

# برای حذف یک دایرکتوری خالی
# os.rmdir(r"C:\Users\Caspian\Desktop\learnit python\S12\new_tst")

# -----------------------------------------------------------

# اجرای دستورات عینا داخل cmd
# os.system("date")
