import shutil
# -----------------------------------------------------------

# برای کپی فایل و حتی تغییر نام فایل کپی شده در مقصد
# shutil.copyfile(r"DIR1\test1.py", r"DIR2\test2.py")

# -----------------------------------------------------------

#  برای کپی فایل بدون تغییر اسم و بدون متا دیتا
# shutil.copy(r"DIR1\test1.py", r"DIR2")

# -----------------------------------------------------------

#  برای کپی فایل بدون تغییر اسم و همراه متا دیتا
# shutil.copy2(r"DIR1\test1.py", r"DIR2")

# -----------------------------------------------------------

# کپی کل محتویات یک دایرکتوری(توجه کنی مقصد نباید از قبل وجود داشته باشد)
# shutil.copytree(r"DIR2", r"DIR3")

# -----------------------------------------------------------

# پاک کردن یک دایرکتوری حتی اگر خالی نباشد
# shutil.rmtree("DIR3")

# -----------------------------------------------------------

# کات کردن یک فایل و اگر از قبل موجود باشد جایگزین میکند
# shutil.move(r"DIR1\test1.py", r"DIR2")
